{"body": "<blockquote>\n  <p>I also check when I stop the camera</p>\n</blockquote>\n\n<p>That is not needed, assuming that you do not try to stop a camera that you never opened. If the user revokes the permission while your app is running, your process is immediately terminated. As a result, you can never lose permissions in a running app. Since you checked for and had permission to open the camera, you already have permission to close it.</p>\n\n<blockquote>\n  <p>if I add this runtime permission checks how does this affect android devices lower than 6.0?</p>\n</blockquote>\n\n<p><code>ContextCompat.checkSelfPermission()</code> will return <code>PackageManager.PERMISSION_GRANTED</code> on older devices, assuming that you have the permission listed in the manifest.</p>\n\n<blockquote>\n  <p>So a phone with version 5.0.1 will also get a prompt to give camera permissions?</p>\n</blockquote>\n\n<p>No.</p>\n\n<blockquote>\n  <p>If I use runtime permissions, do I have to remove the camera permissions in the manifest file?</p>\n</blockquote>\n\n<p>No. Those elements are necessary on all Android versions. </p>\n\n<blockquote>\n  <p>What if I lower the target and compiling sdk to 22 instead of 23, will android devices above 6.0 won't be able to download my app?</p>\n</blockquote>\n\n<p>Your <code>compileSdkVersion</code> has no impact on what versions of Android you support. Android 6.0 users will still be able to download your app.</p>\n\n<p>If you lower your <code>targetSdkVersion</code> to 22 or lower, that too has no impact on what versions of Android that you support. Android 6.0 users will still be able to download your app. Doing this would mean that you could skip the runtime permission code. However, bear in mind that you still may not have permission. Users of Android 6.0 devices, running your <code>targetSdkVersion</code> 22 app, will grant the <code>CAMERA</code> permission by default. But, those users can still go into Settings > Apps, find your app, and revoke the permission. With the camera API, you basically cannot open the camera.</p>\n\n<p>Tactically, going with <code>targetSdkVersion</code> of 22 or lower is certainly possible. Eventually, though, something is going to \"force your hand\" and require you to move to a <code>targetSdkVersion</code> of 23 or higher. So, someday, you will need to deal with the runtime permissions. Whether that is today or some day in the future is up to you do decide.</p>\n", "tags": ["android", "android-camera", "android-permissions", "runtime-permissions", "target-sdk"], "creation_date": 1454805139, "score": 0, "last_activity_date": 1454805139, "answer_id": 35248326, "is_accepted": true, "owner": {"user_id": 115145, "reputation": 596700, "user_type": "registered", "accept_rate": 82, "display_name": "CommonsWare", "link": "http://stackoverflow.com/users/115145/commonsware", "profile_image": "https://i.stack.imgur.com/wDnd8.png?s=128&g=1"}, "title": "confused about android runtime permissions", "question_id": 35248269}