{"title": "Why is sql stored procedure called a stored procedure", "tags": ["sql-server", "stored-procedures"], "creation_date": 1454925547, "score": 1, "body": "<blockquote>\n  <p>Why is a Stored Procedure called stored procedure</p>\n</blockquote>\n\n<p>Because it is a <strong>procedure</strong> that is <strong>stored</strong> in a database.</p>\n\n<p>In other languages/environments, procedures that can be executed aren't usually <em>stored</em>. They are compiled in either bytecode or assembler. I.e. the procedure does not exist in its original textual form anymore. The original procedure cannot be retrieved as it was when it was created in those environments (although reverse engineering can retrieve the essence of that procedure).</p>\n\n<p>When you create a stored procedure in SQL Server, it is completely stored in its original full-text form, same indentation, same casing, same lines, including comments and all. You can retrieve the text with which you created the stored procedure in its entirety. </p>\n\n<blockquote>\n  <p>Simplified explanation about executing a stored procedure</p>\n</blockquote>\n\n<p>When SQL Server wants to execute a stored procedure, it will first check the cache to see if it has been compiled already. If it finds an entry in the cache (in the form of an execution plan) it will use this entry to execute. If it doesn't find an entry it will compile the procedure into an execution plan, store it in the cache for later use, then execute it using the execution plan.</p>\n\n<p>There are cases that force a stored procedure to be recompiled, e.g. when the execution plan cache is cleared (schema changes, statistics updates, ...) or when supplying commands to the compiler that force recompilation (stored procedure <code>WITH RECOMPILE</code>, query option <code>OPTION(RECOMPILE)</code>, ...).</p>\n", "last_activity_date": 1477747167, "answer_id": 35266735, "is_accepted": true, "owner": {"user_id": 243373, "reputation": 7351, "user_type": "registered", "display_name": "TT.", "link": "http://stackoverflow.com/users/243373/tt", "profile_image": "https://i.stack.imgur.com/NxxWB.jpg?s=128&g=1"}, "last_edit_date": 1477747167, "question_id": 35265691}