{"title": "Unity game manager. Script works only one time", "tags": ["c#", "unity3d"], "creation_date": 1457527315, "score": 18, "body": "<h1>In every Unity project you must have A PRELOAD SCENE.</h1>\n\n<h1>It is very confusing that Unity does not have a preload scene \"built-in\". (They will add it in the future.)</h1>\n\n<h1>To repeat, you literally MUST have a preload scene.</h1>\n\n<h1>It's just that simple.</h1>\n\n<h1>This is the SINGLE GREATEST MISUNDERSTANDING for new programmers trying Unity!</h1>\n\n<hr>\n\n<p>I want to emphasize this is ridiculously easy: there's nothing to it. The fact that you see many incredibly complex, ridiculous, posts about constructing quasi-\"singletons\" and other bizarre approaches to this non-issue, is really just one of the weirdest things in the game industry. It's just this easy - one click - let's walk through it in detail including handy tips.</p>\n\n<p><strong>Step 1.</strong></p>\n\n<p>Make a scene named \"preload\". It must be <strong>scene 0</strong> in Build Manager.</p>\n\n<p><a href=\"https://i.stack.imgur.com/aNodp.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/aNodp.png\" alt=\"enter image description here\"></a></p>\n\n<p><strong>Step 2.</strong></p>\n\n<p>In the \"preload\" scene simply have an empty GameObject called say \"_app\". <strong>Simply put <code>DontDestroyOnLoad</code> on '_app'.</strong></p>\n\n<p>Note:</p>\n\n<p>This is <strong><em>the only place in the whole project</em></strong> you use <code>DontDestroyOnLoad</code>. </p>\n\n<p>It really is that simple.</p>\n\n<p><a href=\"https://i.stack.imgur.com/3DiYn.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/3DiYn.png\" alt=\"enter image description here\"></a></p>\n\n<p>(In that image example, the developers have made a trivial DDOL script. Put it on the \"__app\" object. This is much more sensible that \"including the DDOL line somewhere in one of your other scripts\".)</p>\n\n<p><strong>Step 3</strong></p>\n\n<p>You must, and can only, put your \"general\" behaviors ... things like sound effects, scoring, etc ... on \"_app\".</p>\n\n<p>It's just that simple.</p>\n\n<p>(In the image example above, notice say \"Iap\" (in app purchase) and so on. All of the \"general needed behaviors\" like sound effects and so on, are right there on that object.)</p>\n\n<p>To repeat.  Regarding your \"general\" behaviors.  (Sound effects, scoring, etc.) These <strong>CAN ONLY GO</strong> on a game object in the preload scene.</p>\n\n<h1>This <em>is not</em> optional: there is no other alternative.</h1>\n\n<p>You're done. </p>\n\n<p>It is honestly that simple.</p>\n\n<p>Honest: it's just that easy. There is literally nothing to it!</p>\n\n<p>Many engineers coming from other genres take forever to realize it is this simple, because it is so simple and easy it \"can't be true\".  <strong><em>To repeat</em></strong> - the whole problem is that (bizarrely) Unity just plain forgot to \"build-in\" a preload scene. So for that reason, you simply have to click to add one (adding DDOL to it).</p>\n\n<p>Now during development:</p>\n\n<p><strong>Always start your game from Preload scene.</strong></p>\n\n<p>It's that incredibly simple.</p>\n\n<p>(<em>Note</em>. Your app will almost certainly have \"early\" scenes. For example \"splash screen\" or a \"menu\".  <strong><em>You can not</em></strong> use \"splash\" or \"menu\" as the preload scene. You have to literally have a preload scene. The preload scene will <strong><em>then load</em></strong> your splash-scene, menu-scene, or whatever you wish.</p>\n\n<hr>\n\n<p>You then have the problem of, quite simply, finding say \"SoundEffects\" or \"GameManager\" from any script in any of your scenes.</p>\n\n<h1>Fortunately it is <em>dead easy</em>, it is one line of code.</h1>\n\n<h1>It is a non-issue:</h1>\n\n<pre><code>Sound sound = Object.FindObjectOfType&lt;Sound&gt;();\nGame game = Object.FindObjectOfType&lt;Game&gt;();\n</code></pre>\n\n<p>Do that in <code>Awake</code> for any script that needs it.</p>\n\n<p>It's honestly that simple. That's all there is to it.</p>\n\n<h1><code>Sound sound = Object.FindObjectOfType&lt;Sound&gt;();</code></h1>\n\n<p>Tremendous confusion arises because of the 100s of <em>absolutely wrong</em> code examples seen online.  Also, new Unity engineers \"cannot believe\" it is this easy!</p>\n\n<p><strong>It really is this easy - honest!</strong></p>\n\n<p>It's totally bizarre that Unity forgot to add a built-in \"preload scene\" - somewhere to attach your systems like SoundEffects, GameManager, etc. It's just one of those weird thing about Unity. So, the first thing you do in any Unity project is just click once to make a preload scene.</p>\n\n<hr>\n\n<p>DylanB asks: <strong><em>During development</em></strong> it's quite annoying that you have to click to the preload scene every time before you click \"Play\". Can this be automated</p>\n\n<p>Sure, every team has a different way to do this. Here's a trivial example:</p>\n\n<pre><code>// this should run absolutely first; use script execution order to do so.\n// (of course normally never, ever use the script execution order feature,\n// this is an unusual case - just for development.)\n...\npublic class DevPreload:MonoBehaviour\n {\n void Awake()\n  {\n  GameObject check = GameObject.Find(\"__app\");\n  if (check==null)\n   { UnityEngine.SceneManagement.SceneManager.LoadScene(\"_preload\"); }\n  }\n }\n</code></pre>\n\n<p>But don't forget, \"what else can you do?\"  Games <strong><em>have to start</em></strong> from a preload scene.  What else can you do, other than go to the preload scene, to start the game?  You may as well ask \"it's annoying launching Unity to run Unity - how to avoid launching Unity?\"  Games simply, of course, absolutely have to start from a preload scene - how else could it be?  So sure, you have to \"click to the preload scene before you click Play\" when working in Unity - how else could it be?</p>\n", "last_activity_date": 1476370831, "answer_id": 35891919, "is_accepted": true, "owner": {"user_id": 294884, "reputation": 15622, "user_type": "registered", "accept_rate": 89, "display_name": "Joe Blow", "link": "http://stackoverflow.com/users/294884/joe-blow", "profile_image": "https://www.gravatar.com/avatar/f8675693dfeb3908195657eb3a3fdda4?s=128&d=identicon&r=PG"}, "last_edit_date": 1476370831, "question_id": 35890932}