{"title": "WebSocket with multiple ClientEndpoints and binary messages", "tags": ["java", "session", "mobile", "websocket", "codenameone"], "creation_date": 1466009119, "score": 2, "body": "<p>You should be able to track the session without having to pass a session ID.  For example, see <a href=\"https://github.com/shannah/cn1-websockets/blob/master/cn1-websocket-demo-server/src/main/java/com/codename1/cn1/websocket/demo/server/ChatDemoEndpoint.java\" rel=\"nofollow\">this sample web service endpoint</a>.</p>\n\n<p>Notice how you can pass a <code>Session</code> object as the first parameter with the <code>@OnMessage</code> annotation.</p>\n\n<p>You can use this to know who you're talking to.</p>\n\n<p>One other small point/question.  Your statement \"The mobile applications are developed using Codename One, and they do not provide the ability to increase the maximum binary message size,\" seems to suggest that other platforms do allow you to set a maximum binary size on the client.  AFAIK this is not part of the WebSocket spec, and isn't implemented by any browser.  What other implementations do allow you to set the max size?</p>\n\n<p>EDIT In response to your refinement of the question:</p>\n\n<p>There are multiple ways to skin this cat.  One thought is that you only need to chunk the \"last mile\" (between the middleman and the client).  Since the middleman and the end server are JavaEE servers, you have control over the buffer size, and could potentially send the full file in one shot (within reason).  Then just do the chunking in the middle server, which will know which client he is dealing with.</p>\n\n<p>Another option is to create your own pseudo protocol.  You're returning byte arrays, but you could choose to allocate the first n-bytes of each chunk to contain metadata, which the middleman would parse out.  This metadata could be used to tell the middleman which client the chunk is destined for.</p>\n", "last_activity_date": 1466026507, "answer_id": 37841246, "is_accepted": true, "owner": {"user_id": 2935174, "reputation": 1008, "user_type": "registered", "display_name": "steve hannah", "link": "http://stackoverflow.com/users/2935174/steve-hannah", "profile_image": "https://www.gravatar.com/avatar/790492d96cde9864edfb54c10904e204?s=128&d=identicon&r=PG&f=1"}, "last_edit_date": 1466026507, "question_id": 37819361}