{"title": "Performing an asynchronous transformation within a Kafka Stream", "tags": ["concurrency", "apache-kafka", "apache-kafka-streams", "kafka-0.10"], "creation_date": 1466183392, "score": 3, "body": "<p><strong>Update</strong>: after looking in to this further, I am not sure that this is the right answer... </p>\n\n<hr>\n\n<p>I am new to Kafka and Kafka Streams (hereafter referred to as \"Kafka\"), but having encountered and considered similar questions, here is my perspective:</p>\n\n<p>Kafka has two salient features:</p>\n\n<ol>\n<li>All parallelism is achieved through the partitioning of topics</li>\n<li>Within a partition of a topic, processing is strongly ordered, one-at-a-time.</li>\n</ol>\n\n<p>Many really nice properties fall out from these features. For example, <a href=\"https://www.infoq.com/presentations/event-streams-kafka\" rel=\"nofollow\">stream-based \"transactions\"</a>, I think, is one of the coolest. </p>\n\n<p>But whether these properties are actually \"features\" in the sense that you want them, of course, depends on the application. If you don't want strongly ordered processing with parallelism based on topic partitioning, then you might not want to be using Kafka for that application.</p>\n\n<p>So, with regard to:</p>\n\n<blockquote>\n  <p>Does this mean that Kafka Streams will not work in this situation?</p>\n</blockquote>\n\n<p>It will work, but increased parallelism is achieved through increased partitioning.</p>\n\n<blockquote>\n  <p>Does this mean that I must revert back to calling the REST endpoint in a blocking manner?</p>\n</blockquote>\n\n<p>Yes, I think it does—but I'm not sure why that would be a \"reversion\". Personally, that's what I like about Kafka: blocking code is simpler. If I want more parallelism, I can run more threads. There's no shared state, after all.</p>\n", "last_activity_date": 1475767026, "answer_id": 37886908, "is_accepted": true, "owner": {"user_id": 741970, "reputation": 7836, "user_type": "registered", "accept_rate": 60, "display_name": "Dmitry Minkovsky", "link": "http://stackoverflow.com/users/741970/dmitry-minkovsky", "profile_image": "https://www.gravatar.com/avatar/0f017d8f2411f7ae90ffe61149390127?s=128&d=identicon&r=PG"}, "last_edit_date": 1475767026, "question_id": 37764169}