{"body": "<p>Below is an overview of a methodology of how you can do it using the existing simulation framework used by AnyLogic</p>\n\n<p>You need to make use of the simulation setup in order to run multiple runs of the model and save the output. My suggested setup will be the following:</p>\n\n<p>Have a button on your Simulation Experiment page (The first page you see when running the model) that you will use to start off the multiple model runs. In here you set the engine to not run in real time mode by using</p>\n\n<pre><code>getEngine().setRealTimeMode(false);\n</code></pre>\n\n<p>you might also want to set the initial seed and some other model parameters that you might also want to change and perhaps save after model execution. When you have setup the model the way you want use run() to start running the model.</p>\n\n<p>Now under the Simulation Experiment setup page under the 'Java actions' section you need to specify what the model must do after it finished running the model. In the 'After simulation run' section write some code to save the data from the model into your Excel files. To access variables and objects from the model use root, e.g.</p>\n\n<pre><code>saveSomeData(root.myDataset);\n</code></pre>\n\n<p>where saveSomeData is a function on the Simulation page to save my data set found on the model, called myDataset, to an Excel file. It would be great to also save the seed and the specific parameters, if you changed any, to the Excel file for future reference.</p>\n\n<p>Once you have saved the data output from the model you can specify a new seed and perhaps change parameters again and then call the run() again to run the model for another iteration. When the model has finished running it will again call the 'After simulation run' code here, so do put a stop condition otherwise it will just continue running one iteration after the other. You can access the number of model runs by using</p>\n\n<p>getEngine().getRunCount()</p>\n\n<p>Also, your model needs to have some stop condition, otherwise once it starts running it will never stop. You can specify this in the Simulation Experiment page under the 'Model time' section or programatically in your model using </p>\n\n<pre><code>finishSimulation();\n</code></pre>\n", "tags": ["loops", "simulation", "anylogic"], "creation_date": 1466490403, "score": 2, "last_activity_date": 1466490403, "answer_id": 37936980, "is_accepted": true, "owner": {"user_id": 4019094, "reputation": 71, "user_type": "registered", "display_name": "Jaco-Ben Vosloo", "link": "http://stackoverflow.com/users/4019094/jaco-ben-vosloo", "profile_image": "https://lh6.googleusercontent.com/-Vd8QzlfS03s/AAAAAAAAAAI/AAAAAAAACBI/Dpq0XJ69oLQ/photo.jpg?sz=128"}, "title": "Runnig N times the simulation in anylogic", "question_id": 37920538}