{"title": "Project Architecture with Xamarin and Asp.Net Core Identity", "tags": ["entity-framework", "xamarin", "architecture", "asp.net-core", "asp.net-identity"], "creation_date": 1467462898, "score": 4, "body": "<p>Your Xamarin code should be totally decoupled from server business logic and data access. Why would you reference AspNet Identity from Xamarin? Those are two completely different layers.</p>\n\n<p>Your server Web API has to expose REST methods to handle authentication/authorization and other stuff so a client can consume them (web client, mobile client, desktop client, whatever). </p>\n\n<p>Xamarin should consume those remote methods with a <a href=\"https://github.com/paulcbetts/refit\" rel=\"nofollow\">REST client</a>, in the same fashion a javascript client would. </p>\n\n<p>I understand from your question that you want to reuse business objects / models in your xamarin project just because they are written in C#. But if those objects have dependencies on asp.net identity, you can´t.\nIn that case you should <a href=\"http://automapper.org/\" rel=\"nofollow\">map</a> your business objects (BO) to data transfer objects (DTO) that web API will use to communicate with clients.\nDTO´s are completely agnostic from any data access layer and should be simple <a href=\"http://stackoverflow.com/questions/250001/poco-definition\">POCO</a>´s. They are meant to be serialized/deserialized to/from json/xml.</p>\n\n<p>On the other hand, you don´t want to serialize user models \"as is\" through a web api because that implies sending sensitive data over the internet like user hashed passwords, etc. Your DTO´s should just have the fields needed in your client, and the mapping will do the rest.</p>\n", "last_activity_date": 1467547259, "answer_id": 38160203, "is_accepted": true, "owner": {"user_id": 1850606, "reputation": 1901, "user_type": "registered", "accept_rate": 86, "display_name": "xleon", "link": "http://stackoverflow.com/users/1850606/xleon", "profile_image": "https://www.gravatar.com/avatar/b9371d959d3460b285f7f5f679a45c73?s=128&d=identicon&r=PG"}, "last_edit_date": 1467547259, "question_id": 38158616}