{"title": "I Want to allow users who are logged in to edit their info", "tags": ["php", "html", "mysql"], "creation_date": 1467875263, "score": 1, "body": "<p>Brother, for the sake of least security purpose of the users of your website, please do not implement these codes to edit or update informations. i may tell you some reasons for that.</p>\n\n<ol>\n<li><p>You are using <strong>mysql*</strong> that is the stuff of php4 and you must know that current version is php7 so you are using a really old version.\nYou must learn PDO or MySQLi. PDO would be preferable.</p>\n\n<p>Learning new stuff like MySQLi/PDO is not a rocket science, it will take just couple of days, but the result would be far more better than your current situation. </p></li>\n<li><p>You are using queries like <code>UPDATE xyz SET x = \"123\", y=\"456\" WHERE z = \"987\"</code> A really novice hacker may retrieve your database information using merely address bar of browser. Precisely learn about special chars escaping like <strong>htmlspecialchars</strong>,or PDO Params for the purpose like <code>$firstname = htmlspecialchars($_POST['firstName'])</code>.</p></li>\n<li><p>For retrieving the data from database for a unique user, preferably use session. `</p>\n\n<p>Session is nothing but the access data on server for the environment of your website.  Each time you run a login script, then at the line where your code completes all check, use this code:</p>\n\n<pre><code>session_start(); \n$_SESSION['firstname'] = htmlspecialchars($_POST['firstname'])\n// and so on...\n</code></pre>\n\n<p>That is ok. Now in the form where you want to fill the user data, use</p>\n\n<pre><code>&lt;input type=\"text\" value=\"&lt;?php echo $_SESSION['firstname'];?&gt;\"&gt;`\n</code></pre></li>\n</ol>\n", "last_activity_date": 1467875742, "answer_id": 38239427, "is_accepted": true, "owner": {"user_id": 5330299, "reputation": 536, "user_type": "registered", "display_name": "Shudhansh Shekhar", "link": "http://stackoverflow.com/users/5330299/shudhansh-shekhar", "profile_image": "https://lh5.googleusercontent.com/-laxDAxYM2O8/AAAAAAAAAAI/AAAAAAAAAIM/ytpatI12ZWc/photo.jpg?sz=128"}, "last_edit_date": 1467875742, "question_id": 38238252}