{"title": "Moving from socket.io to raw websockets?", "tags": ["websocket", "socket.io"], "creation_date": 1469308924, "score": 3, "body": "<p>The socket.io library adds the following features beyond standard webSockets:</p>\n\n<ol>\n<li><p>Automatic selection of long polling vs. webSocket if the browser does not support webSockets or if the network path has a proxy/firewall that blocks webSockets.</p></li>\n<li><p>Automatic client reconnection if the connection goes down (even if the server restarts).</p></li>\n<li><p>Automatic detection of a dead connection (by using regular pings to detect a non-functioning connection)</p></li>\n<li><p>Message passing scheme with automatic conversion to/from JSON.</p></li>\n<li><p>The server-side concept of rooms where it's easy to communicate with a group of connected users.</p></li>\n<li><p>The notion of connecting to a namespace on the server rather than just connecting to the server.  This can be used for a variety of different capabilities, but I use it to tell the server what types of information I want to subscribe to.  It's like connection to a particular channel.</p></li>\n<li><p>Server-side data structures that automatically keep track of all connected clients so you can enumerate them at any time.</p></li>\n<li><p>Middleware architecture built-in to the socket.io library that can be used to implement things like authentication with access to cookies from the original connection.</p></li>\n<li><p>Automatic storage of the cookies and other headers present on the connection when it was first connected (very useful for identifying what user is connected).</p></li>\n<li><p>Server-side broadcast capabilities to send a common message to either to all connected clients, all clients in a room or all clients in a namespace.</p></li>\n</ol>\n", "last_activity_date": 1477760247, "answer_id": 38546537, "is_accepted": true, "owner": {"user_id": 816620, "reputation": 289145, "user_type": "registered", "accept_rate": 59, "display_name": "jfriend00", "link": "http://stackoverflow.com/users/816620/jfriend00", "profile_image": "https://www.gravatar.com/avatar/162aa26d42813f31a21ced4bc9195f23?s=128&d=identicon&r=PG"}, "last_edit_date": 1477760247, "question_id": 38546496}