{"title": "JavaScript confusing with script file placing place", "tags": ["javascript", "angularjs"], "creation_date": 1471536952, "score": 1, "body": "<p>Technically it's only best practice if you don't care \"much\" for the sequential loading of script files. You figured out you need a library first before you can call it. Hence people load all of their custom scripts in the bottom, after the HTML is loaded, so they don't need to take care of that particular <code>DOM loaded</code> event and to counter <a href=\"https://developers.google.com/speed/docs/insights/BlockingJS\" rel=\"nofollow\">render blocking scripts</a> which is what happens when you simply put them all in the head tag.</p>\n\n<p>But JavaScript libraries are actually dependencies that need to be fully loaded first. Technically also on small band (or these days compare it with slow smartphones). And you should also know that the http protocol allows you to download 2 requests at once.</p>\n\n<p>With that info in mind, I say <strong>best practice</strong> is one bundled script file put on <code>async</code> mode loaded from the head-tag, preferably minified. Achievable with a grunt/gulp setup or some sort.</p>\n\n<pre><code>&lt;head&gt;\n    &lt;title&gt;&lt;/title&gt;\n    &lt;script src='path-to-bundled-script.js' async='async' /&gt;\n&lt;/head&gt;\n</code></pre>\n\n<p>The <code>async</code> attribute makes sure the page loading doesn't wait on this script to be fully loaded. It still does wait on more than one http requests, hence the bundeling for sequential execution.</p>\n\n<p>So when you are developping and you don't have your grunt/gulp setup completed for this bundle, you will hit errors, saying that libraries aren't loaded or symbols aren't recognized.</p>\n\n<p>To solve this you can use the attribute <code>defer</code>.</p>\n\n<pre><code>&lt;head&gt;\n    &lt;title&gt;&lt;/title&gt;\n    &lt;script src='path-to-library.js' defer='defer' /&gt;\n    &lt;script src='path-to-library2.js' defer='defer' /&gt;\n    &lt;script src='path-to-library3.js' defer='defer' /&gt;\n    &lt;script src='path-to-custom1.js' defer='defer' /&gt;\n    &lt;script src='path-to-custom2.js' defer='defer' /&gt;\n&lt;/head&gt;\n</code></pre>\n\n<p>With the defer attribute, the page load will wait for the scripts to be executed, but not for the HTML to be completely loaded.</p>\n\n<p>Using this technique, you can forget about the closing body tag as best practice and you'll gain speeds testable with google's <a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow\">pagespeed insight</a></p>\n", "last_activity_date": 1477680991, "answer_id": 39023042, "is_accepted": true, "owner": {"user_id": 1114530, "reputation": 3077, "user_type": "registered", "display_name": "Tim Vermaelen", "link": "http://stackoverflow.com/users/1114530/tim-vermaelen", "profile_image": "https://i.stack.imgur.com/PJv9x.jpg?s=128&g=1"}, "last_edit_date": 1477680991, "question_id": 39022556}