{"title": "Struts 2 and Spring how struts-created objects handled", "tags": ["java", "spring", "dependency-injection", "struts2", "integration"], "creation_date": 1474916336, "score": 3, "body": "<p>Struts uses an <code>ObjectFactory</code> to build any object like actions, interceptors, validators, etc.:</p>\n\n<blockquote>\n  <p><code>ObjectFactory</code> is responsible for building the core framework objects. Users may register their \n   own implementation of the <code>ObjectFactory</code> to control instantiation of these Objects.</p>\n</blockquote>\n\n<p>Struts-Spring plugin registers its own object factory <code>StrutsSpringObjectFactory</code>:</p>\n\n<blockquote>\n  <p>Struts object factory that integrates with Spring.</p>\n</blockquote>\n\n<p>There, it overrides methods building Objects, such as <code>buildBean()</code>.</p>\n\n<p>Now if you look at the implementation, it is using method <code>org.springframework.beans.factory.config.AutowireCapableBeanFactory#createBean()</code></p>\n\n<p>which generally creates a new instance of the clazz argument.</p>\n\n<blockquote>\n  <p>Central method of this class: creates a bean instance,\n       populates the bean instance, applies post-processors, etc.</p>\n</blockquote>\n\n<p>Then, the newly created instance is passed for autowiring with <code>org.springframework.beans.factory.config.AutowireCapableBeanFactory#autowireBeanProperties()</code></p>\n\n<p>After that, this instance is passed to Guice for injection.</p>\n\n<p>Now it's fully <em>baked</em> and ready to return.</p>\n\n<hr>\n\n<p>Note that, if the bean is managed by Spring, it uses <code>getBean</code> method from application context, otherwise the new instance is created always by struts-spring plugin if the bean is not managed by Spring.</p>\n", "last_activity_date": 1476467352, "answer_id": 39710353, "is_accepted": true, "owner": {"user_id": 573032, "reputation": 34515, "user_type": "registered", "accept_rate": 91, "display_name": "Roman C", "link": "http://stackoverflow.com/users/573032/roman-c", "profile_image": "https://www.gravatar.com/avatar/bca617231294691f95f0e9f0ee623630?s=128&d=identicon&r=PG"}, "last_edit_date": 1476467352, "question_id": 39706221}