{"title": "Should I use boolean type for non yes/no answer variable?", "tags": ["c++"], "creation_date": 1475108401, "score": 12, "body": "<p>Well, it depends.</p>\n\n<p>Your goal is to write clear, readable, maintainable, and correct code. It's not so much that <code>bool</code> necessitates a yes vs. no answer as much as it is a question of whether or not using boolean (or any other type for that matter) helps you to meet these goals. If it makes your code clear, it's worth considering. If it makes things confusing, it's not a good idea.</p>\n\n<p>For example, you may only have two types of tires, but consider a couple of things:</p>\n\n<ul>\n<li>How do you know you won't add more later? You don't want to shoot yourself in the foot.</li>\n<li>When writing / reading the code how do you remember that <code>true</code> is \"summer\" and <code>false</code> is \"winter\"? Will you have to maintain that info in your head / always look it up somewhere? Will it be easy to make a mistake? Will it confuse a reader who is unfamiliar with your code?</li>\n</ul>\n\n<p>Think about those kinds of things. In your case, while using a boolean will certainly get the job done, I'd say it's a good use for an <code>enum</code>, even if you only have two values right now (or ever). E.g.:</p>\n\n<pre><code>enum TireType { WinterTire, SummerTire };\n</code></pre>\n\n<p>Now everything falls into place:</p>\n\n<ul>\n<li>You can add new types in the future if you'd like, with no major issues.</li>\n<li>A variable <code>TireType t</code> documents itself, we know just at a glance that <code>t</code> is a tire type.</li>\n<li>There is much less of a chance of mistake when entering values: It'll be very hard to confuse <code>WinterTire</code> with <code>SummerTire</code>, whereas <code>true</code> and <code>false</code> discard all semantic meaning.</li>\n</ul>\n", "last_activity_date": 1475158033, "answer_id": 39759505, "is_accepted": true, "owner": {"user_id": 616460, "reputation": 23170, "user_type": "registered", "accept_rate": 96, "display_name": "Jason C", "link": "http://stackoverflow.com/users/616460/jason-c", "profile_image": "https://i.stack.imgur.com/Yiloe.png?s=128&g=1"}, "last_edit_date": 1475158033, "question_id": 39759422}