{"body": "<p><a href=\"https://blogs.technet.microsoft.com/ash/2016/03/02/windows-10-device-guard-and-credential-guard-demystified/\" rel=\"nofollow\">Device/Credential Guard is a Hyper-V based Virtual Machine/Virtual Secure Mode</a> that hosts a secure kernel to make Windows 10 much more secure.</p>\n\n<p><a href=\"http://i.stack.imgur.com/bC6Id.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/bC6Id.png\" alt=\"enter image description here\"></a></p>\n\n<blockquote>\n  <p>...the VSM instance is segregated from the normal operating\n  system functions and is protected by attempts to read information in\n  that mode. The protections are hardware assisted, since the hypervisor\n  is requesting the hardware treat those memory pages differently. This\n  is the same way to two virtual machines on the same host cannot\n  interact with each other; their memory is independent and hardware\n  regulated to ensure each VM can only access it’s own data.</p>\n  \n  <p>From here, we now have a protected mode where we can run security\n  sensitive operations. At the time of writing, we support three\n  capabilities that can reside here: the Local Security Authority (LSA),\n  and Code Integrity control functions in the form of Kernel Mode Code\n  Integrity (KMCI) and the hypervisor code integrity control itself,\n  which is called Hypervisor Code Integrity (HVCI).</p>\n</blockquote>\n\n<p><a href=\"http://i.stack.imgur.com/8NOn4.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/8NOn4.png\" alt=\"enter image description here\"></a></p>\n\n<blockquote>\n  <p>When these capabilities are handled by Trustlets in VSM, the Host OS\n  simply communicates with them through standard channels and\n  capabilities inside of the OS. While this Trustlet-specific\n  communication is allowed, having malicious code or users in the Host\n  OS attempt to read or manipulate the data in VSM will be significantly\n  harder than on a system without this configured, providing the\n  security benefit.</p>\n  \n  <p>Running LSA in VSM, causes the LSA process itself (LSASS) to remain in\n  the Host OS, and a special, additional instance of LSA (called LSAIso\n  – which stands for LSA Isolated) is created. This is to allow all of\n  the standard calls to LSA to still succeed, offering excellent legacy\n  and backwards compatibility, even for services or capabilities that\n  require direct communication with LSA. In this respect, you can think\n  of the remaining LSA instance in the Host OS as a ‘proxy’ or ‘stub’\n  instance that simply communicates with the isolated version in\n  prescribed ways.</p>\n</blockquote>\n\n<p><br><br><br><br>\nAnd Hyper-V and VMware <strong>can't work the same time</strong>. You have to migrate your VMs to Hyper-V or disable the feature. It should be enough to enselect the Hyper-V and Isolated user mode features in Control Panel->Program &amp; Features->turn features on or off:</p>\n\n<p><a href=\"http://i.stack.imgur.com/rRMcT.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/rRMcT.png\" alt=\"enter image description here\"></a></p>\n", "tags": ["cmd", "windows-10", "vmware", "mount"], "creation_date": 1475650146, "score": 2, "last_activity_date": 1475650146, "answer_id": 39867169, "is_accepted": true, "owner": {"user_id": 1466046, "reputation": 7248, "user_type": "registered", "accept_rate": 75, "display_name": "magicandre1981", "link": "http://stackoverflow.com/users/1466046/magicandre1981", "profile_image": "https://i.stack.imgur.com/Fa7gP.png?s=128&g=1"}, "title": "VMware Workstation and Device/Credential Guard are not compatible", "question_id": 39858200}