{"title": "what is offline and online indexing in Elastic search? and when do we need to reindex?", "tags": ["elasticsearch"], "creation_date": 1475749965, "score": 1, "body": "<h1>Reindexing</h1>\n\n<p>The most basic form if reindexing just copies one index to another.</p>\n\n<p>I have used this form of reindexing to change a mapping. \nElasticsearch doesn't allow you to change a mapping, so if you want to change a mapping you have to create a new index (index2) with a new mapping and then reindex. The reindex will fill that new mapping with the data of the old index.</p>\n\n<p>The command below will move everything from index to index2. </p>\n\n<pre><code>curl -XPOST 'localhost:9200/_reindex?pretty' -d'\n{\n  \"source\": {\n    \"index\": \"index\"\n  },\n  \"dest\": {\n    \"index\": \"index2\"\n  }\n}'\n</code></pre>\n\n<p>You can also use reindexing to fill a new index with a part of the old one. You can do so by using a couple of parameters. The example below will copy the newest 1000 documents.</p>\n\n<p>POST /_reindex\n{\n  \"size\": 1000,\n  \"source\": {\n    \"index\": \"index\",\n    \"sort\": { \"date\": \"desc\" }\n  },\n  \"dest\": {\n    \"index\": \"index2\"\n  }\n}</p>\n\n<p>For more examples about reindexing please have a look at the <a href=\"https://www.elastic.co/guide/en/elasticsearch/reference/2.3/docs-reindex.html\" rel=\"nofollow\">official documentation</a>.</p>\n\n<h1>offline vs online indexing</h1>\n\n<p>In ONLINE mode the new index is built while the old index is accessible to reads and writes. any update on the old index will also get applied to the new index. </p>\n\n<p>In OFFLINE mode the table is locked up front for any read or write, and then the new index gets built from the old index. No read or write operation is permitted on the table while the index is being rebuilt. Only when the operation is done is the lock on the table released and reads and writes are allowed again.</p>\n", "last_activity_date": 1475752231, "answer_id": 39893695, "is_accepted": true, "owner": {"user_id": 5033031, "reputation": 464, "user_type": "registered", "accept_rate": 80, "display_name": "Rick van Lieshout", "link": "http://stackoverflow.com/users/5033031/rick-van-lieshout", "profile_image": "https://lh5.googleusercontent.com/-K3kbNrRBQ2g/AAAAAAAAAAI/AAAAAAAAATE/XxcsC4rT39o/photo.jpg?sz=128"}, "last_edit_date": 1475752231, "question_id": 39893443}