{"title": "use spring boot with existing tomcat without war deployment", "tags": ["java", "spring", "tomcat", "spring-boot"], "creation_date": 1475936627, "score": 1, "body": "<p>If you want to use existing Tomcat instance you <em>should</em> deploy a war file to it. The instance is running it's own JVM and to hook into it you should provide <code>ServletInitializer</code>. </p>\n\n<p>See detailed description how to <a href=\"https://spring.io/blog/2014/03/07/deploying-spring-boot-applications#what-about-the-java-ee-application-server\" rel=\"nofollow\">Deploying Spring Boot Applications. What about the Java EE Application Server?</a>.</p>\n\n<blockquote>\n  <p>But, I imagine you wondering, “how do I deploy it to an existing\n  Tomcat installation, or to the classic Java EE application servers\n  (some of which cost a lot of money!) like WebSphere, WebLogic, or\n  JBoss?” Easy! It’s still just Spring, after all, so very little else\n  is required. You’ll need to make three intuitive changes: move from a\n  jar build to a war build in Maven: comment out the declaration of the\n  spring-boot-maven-plugin plugin in your <code>pom.xml</code> file, then change the\n  Maven packaging type to war. Finally, add a web entry point into your\n  application.</p>\n</blockquote>\n\n<hr>\n\n<p>You should read this document further where you can make changes to <code>pom.xml</code> to exclude not used dependencies.</p>\n\n<blockquote>\n  <p>You may experience issues if you have classes that conflict with those\n  that ship as parter of a larger application server. In this case, use\n  your build tool’s facilities for excluding or making optional the\n  relevant APIs.</p>\n</blockquote>\n\n<hr>\n", "last_activity_date": 1475937207, "answer_id": 39933519, "is_accepted": false, "owner": {"user_id": 573032, "reputation": 34515, "user_type": "registered", "accept_rate": 91, "display_name": "Roman C", "link": "http://stackoverflow.com/users/573032/roman-c", "profile_image": "https://www.gravatar.com/avatar/bca617231294691f95f0e9f0ee623630?s=128&d=identicon&r=PG"}, "last_edit_date": 1475937207, "question_id": 39933143}