{"title": "Delphi: GR32 draw a PNG with alpha onto a TBitmap32 without clearing its content", "tags": ["delphi", "png", "transparent", "alpha"], "creation_date": 1476916042, "score": 2, "body": "<p>There are two ways of working with transparent PNG files:</p>\n\n<ol>\n <li>Load them into intermediary TBitmap32 bitmaps and then manipulate these TBitmap32 bitmaps.\n <li>Use TPngImage.Draw (implemented in Vcl.Imaging.pngimage with Delphi XE2 and later) directly on target Canvas, as you have pointed out.\n</ol>\n\n<p>The second way is preferable when it comes to transparency, because the code that you may find to load a PNG into TBitmap32 may work incorrectly. Here are the two examples of the incorrect code that is used most frequently:</p>\n\n<p>(1) “LoadPNGintoBitmap32” from <a href=\"http://graphics32.org/wiki/FAQ/ImageFormatRelated\" rel=\"nofollow\">http://graphics32.org/wiki/FAQ/ImageFormatRelated</a>\n- it applies the transparency twice, so the images with alpha values other than 0 or 255 will look differently than in other software (most noticeable on translucent images with glass effects). This code will first apply alpha to RGB and then sets alpha, so when you pain, alpha will be applied again. You can add more information on this issue here: <a href=\"http://stackoverflow.com/questions/8213460/delphi-gr32-pngobject-converting-to-bitmap32-doesnt-work-as-expected\">Delphi, GR32 + PngObject: converting to Bitmap32 doesn&#39;t work as expected</a> \n. Besides that, it doesn't convert correctly transparency from paletted images into the alpha layer of TBitmap32.</p>\n\n<p>(2) “LoadBitmap32FromPNG” from gr32ex library: <a href=\"https://code.google.com/archive/p/gr32ex/\" rel=\"nofollow\">https://code.google.com/archive/p/gr32ex/</a>\n- a slightly different implementation of the same algorithm as (1), and has the same issues as (1).</p>\n\n<p>If you still prefer using TBitmap32, make the following sequence of steps:</p>\n\n<ol>\n<li>Make sure your code correctly converts PNG to TBitmap32.\n<li>Do not use TBitmap32 with transparent images to draw directly on HDC, Canvas or TBitmap. Use dmBlend and DrawTo or BlockTransfer() to draw on another TBitmap32. For example, to draw transparently on a TBitmap, create an intermediary cache TBitmap32:\n<ol><li>Copy the image from TBitmap to the cache TBitmap32;\n<li>Apply your transparent image to the cache TBitmap32 using DrawTo or BlockTransfer(), avoid using Canvas or HDC to mix two images because they lose alpha layer information;\n<li>Copy the image back from the cache TBitmap32 to your TBitmap.\n</ol></ol>\n", "last_activity_date": 1477745566, "answer_id": 40142531, "is_accepted": true, "owner": {"user_id": 6910868, "reputation": 52, "user_type": "registered", "display_name": "Maxim Masiutin", "link": "http://stackoverflow.com/users/6910868/maxim-masiutin", "profile_image": "https://www.gravatar.com/avatar/62a482589a04495b3c755be0e35bb0e3?s=128&d=identicon&r=PG&f=1"}, "last_edit_date": 1477745566, "question_id": 39812396}