{"body": "<p>Most likely this is happening because of <code>mod_ruid2</code> being installed. In order to access the site via <code>publicIPaddress/~username</code> you have to install <code>mod_userdir</code>. </p>\n\n<p>unfortunately you can't use <code>mod_userdir</code> and <code>mod_ruid2</code> at the same time. So these are the steps for configuring your WHM to allow access with <code>ip/~username</code></p>\n\n<p>Login to WHM with your root user. Go to mod_userdir TWEAK which you can access using the search bar on the left side of the GUI. \n<a href=\"https://i.stack.imgur.com/WjVA9.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/WjVA9.png\" alt=\"enter image description here\"></a></p>\n\n<p>At this point check the box to install the service. After it installs you should be able to access the site with <code>ip/~username</code>. It is very likely it will not install because there are conflicts with <code>mod_ruid2</code> and <code>CGI</code> being installed. So you remove them like this,</p>\n\n<p>Go back to the search bar and type EasyApache. Click the link when it pops up,\n<a href=\"https://i.stack.imgur.com/kRQID.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/kRQID.png\" alt=\"enter image description here\"></a></p>\n\n<p>Click customize and then next or click Server Modules on the left. In the main area and your current setup will load. First type <code>mod_ruid2</code> in the search bar. When it pops up click to uninstall it. </p>\n\n<p>Next search for <code>CGI</code> and if <code>ea-apache24-mod_cgi</code> uninstall it as well. </p>\n\n<p>Now you need to use another handler so in my case I chose suphp. </p>\n\n<pre><code>ea-apache24-mod_suphp\n</code></pre>\n\n<p>Once you choose to install it you will need to choose Prefork Worker or Event.</p>\n\n<p>Here are the descriptions of these, </p>\n\n<blockquote>\n  <p>Prefork With the Prefork module installed, Apache is a non-threaded,\n  pre-forking web server. That means that each Apache child process\n  contains a single thread and handles one request at a time. Because of\n  that, it consumes more resources than the threaded MPMs: Worker and\n  Event.</p>\n  \n  <p>Prefork is the default MPM, so if no MPM is selected in EasyApache,\n  Prefork will be selected. It still is the best choice if Apache has to\n  use non-thread safe libraries such as mod_php (DSO), and is ideal if\n  isolation of processes is important.</p>\n  \n  <p>Worker The Worker MPM turns Apache into a multi-process,\n  multi-threaded web server. Unlike Prefork, each child process under\n  Worker can have multiple threads. As such, Worker can handle more\n  requests with fewer resources than Prefork. Worker generally is\n  recommended for high-traffic servers running Apache versions prior to\n  2.4. However, Worker is incompatible with non-thread safe libraries. If you need to run something that isn’t thread safe, you will need to\n  stick with Prefork.</p>\n  \n  <p>Event Each process under Event also can contain multiple threads but,\n  unlike Worker, each is capable of more than one task. Apache has the\n  lowest resource requirements when used with the Event MPM.</p>\n  \n  <p>Event, though, is supported only on servers running Apache 2.4. Under\n  Apache 2.2, Event is considered experimental and is incompatible with\n  some modules on older versions of Apache. Nevertheless, on\n  high-traffic Apache 2.2 servers where Apache has experienced issues\n  with memory, upgrading Apache to take advantage of the Event MPM can\n  yield significant results.</p>\n</blockquote>\n\n<p>After you are done installing the new modules and removing the old ones you need to ssh into your server and type\nFor Centos 7 </p>\n\n<pre><code>/usr/local/cpanel/bin/rebuild_phpconf --available\n</code></pre>\n\n<p>This will show you something like this,<a href=\"https://i.stack.imgur.com/q1MSK.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/q1MSK.png\" alt=\"enter image description here\"></a></p>\n\n<p>At this point I checked my current php install like this,</p>\n\n<pre><code>php -v\nPHP 5.6.27\n</code></pre>\n\n<p>So I decided to go with the correlating PHP version for my handler. So now you have to select the handler like this,</p>\n\n<pre><code>/usr/local/cpanel/bin/rebuild_phpconf --default=ea-php56 --ea-php56=suphp \n</code></pre>\n\n<p>At this point make sure you go back to <code>mod_userdir</code> in your whm search bar and try and install it again. If it installs with no errors then try and access the page in your browser with <code>ipaddress/~username</code>. If you still can not access it then go back to your <code>mod_userdir</code> screen and make sure you check mark the box next to your user that says exclude protection.</p>\n\n<p><a href=\"https://i.stack.imgur.com/Fxn1S.png\" rel=\"nofollow\"><img src=\"https://i.stack.imgur.com/Fxn1S.png\" alt=\"enter image description here\"></a></p>\n", "tags": ["cpanel"], "creation_date": 1477269986, "score": 0, "last_activity_date": 1477269986, "answer_id": 40209290, "is_accepted": false, "owner": {"user_id": 2218253, "reputation": 1837, "user_type": "registered", "accept_rate": 83, "display_name": "wuno", "link": "http://stackoverflow.com/users/2218253/wuno", "profile_image": "https://www.gravatar.com/avatar/4764f26a78b60aeed3f2e83aa3a4e788?s=128&d=identicon&r=PG&f=1"}, "title": "I can&#39;t access my website using its ip number", "question_id": 26168473}