{"title": "What is Protocol Oriented Programming in Swift? What added value does it bring?", "tags": ["objective-c", "oop", "swift2", "protocols", "delegation"], "creation_date": 1477496047, "score": 1, "body": "<p><strong>It surprised me that none of the answers mentioned value type in POP.</strong></p>\n\n<p>To understand what is protocol oriented programming, you need to understand what are drawbacks of objected oriented programming.</p>\n\n<ol>\n<li>It has only one inheritance. If we have very complicated hierarchy of inheritance, the bottom class may have a lot of unnecessary state to hold.</li>\n<li>It uses class which is a reference type. Reference type may cause code unsafe. e.g. Processing collection of reference types while they are being modified.</li>\n</ol>\n\n<p>While in protocol oriented programming in swift:</p>\n\n<ol>\n<li>It can conform multiple protocols.</li>\n<li>It can be used by not only class, but also structures and enumerations.</li>\n<li>It has protocol extension which gives us common functionality to all types that conforms to a protocol.</li>\n<li>It prefers to use value type instead of reference type. Have a look at the standard swift library <a href=\"https://developer.apple.com/reference/swift\" rel=\"nofollow\">here</a>, you can find majority of types are structures which is value type. But this doesn't mean you don't use class at all, in some situation, you have to use class e.g. Singleton.</li>\n</ol>\n\n<p>So protocol oriented programming is nothing but just an another programming paradigm that try to solve the OOP drawbacks.</p>\n", "last_activity_date": 1477499566, "answer_id": 40266443, "is_accepted": false, "owner": {"user_id": 833885, "reputation": 1651, "user_type": "registered", "accept_rate": 100, "display_name": "brianLikeApple", "link": "http://stackoverflow.com/users/833885/brianlikeapple", "profile_image": "https://www.gravatar.com/avatar/36088feaa24c5a8989fa5fdc68383787?s=128&d=identicon&r=PG"}, "last_edit_date": 1477499566, "question_id": 37530346}