{"title": "Which end of a list is the top?", "tags": ["python", "list", "stack", "queue"], "creation_date": 1477523355, "score": 5, "body": "<blockquote>\n  <p>Is there a definition for both \"front\" and \"top\" in terms of stacks/queues which are basically just lists or are these terms ambiguous</p>\n</blockquote>\n\n<p>The question is built on a false premise, that stacks/queues are \"basically just lists\".  </p>\n\n<p>Take a look at this picture, which shows how python lists are stored in memory (CPython)</p>\n\n<p><a href=\"http://i.stack.imgur.com/KM4No.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/KM4No.png\" alt=\"it&#39;s a python list, dawg!\"></a></p>\n\n<p><em>(image source: <a href=\"https://jakevdp.github.io/blog/2014/05/09/why-python-is-slow/\" rel=\"nofollow\">here</a>)</em></p>\n\n<p>The implementation is actually nothing much like a stack or a queue, and the actual list objects can be all over the place in memory.  </p>\n\n<h1>Stacks:</h1>\n\n<p>This one's pretty clear-cut: if someone speaks about the \"top\" of the stack, they would be referring to the item that was most recently added to the stack.  That's the item you'll get if you \"pop\" off the stack. </p>\n\n<h1>Queues:</h1>\n\n<p>This one's a bit more airy-fairy.  If someone refers to the front of the queue, they probably mean the item which was added earliest, since queues are usually implemented \"FIFO\" (first in first out).  But, it does depend on the implementation, for example there is also a <a href=\"https://docs.python.org/2/library/queue.html#Queue.LifoQueue\" rel=\"nofollow\">LIFO Queue</a> in python, which orders more like a stack.  To make matters worse, there are also deques (double-ended queues) so you really need to have more context to understand this bit of CS jargon.</p>\n", "last_activity_date": 1477524077, "answer_id": 40273552, "is_accepted": true, "owner": {"user_id": 674039, "reputation": 77804, "user_type": "registered", "accept_rate": 95, "display_name": "wim", "link": "http://stackoverflow.com/users/674039/wim", "profile_image": "https://i.stack.imgur.com/leoFi.gif?s=128&g=1"}, "last_edit_date": 1477524077, "question_id": 40273427}