{"title": "Array Function. Would appreciate a little clarification", "tags": ["c++", "arrays", "function"], "creation_date": 1477660024, "score": 1, "body": "<p>For my whole answer I assume that this:</p>\n\n<blockquote>\n  <p><strong>Question</strong>: In a program, write a function that accepts three arguments: an array, the size of the array, and a number n. Assume that the array contains integers. The function should display all of the numbers in the array that are greater than the number n .</p>\n</blockquote>\n\n<p>is the whole assignment.</p>\n\n<ol>\n<li><p><code>void arrayFunction(int[], int, int);</code> is probably the only thing you could write. Note however that <code>int[]</code> is in fact <code>int*</code>.</p></li>\n<li><p>As others pointed out don't bother with receiving input. Use something along this line: <code>int numbers[] = {2,4,8,5,7,45,8,26,5,94,6,5,8};</code>. It will create static array for you;</p></li>\n<li><p>You have parameter <code>int n</code> but you never use it.</p></li>\n<li><p>You are trying to send <code>variable</code> to the function <code>arrayFunction</code> but I can't see definition of this variable!</p></li>\n<li><p>Use something called <strong>rubber duck debugging</strong> (google for it :) ). It will really help you.</p></li>\n</ol>\n\n<p>If you have some more precise question, ask them.</p>\n\n<p>As a side note: there are better ways of sending an array to the function, but your assignment forces you to use this old and not-so-good solution.</p>\n\n<blockquote>\n  <p>Would you use an if else statement? I've edited my original post with the updated code.</p>\n</blockquote>\n\n<p>You have updated question, then I update my answer.</p>\n\n<p><strong>First and foremost of all: do indent your code properly!!!</strong><br>\nIf you do that, your code will be much cleaner, much more readable, and it will be much easier understandable not only for us, but primairly for you.</p>\n\n<p>Next thing: do not omit braces even if they are not required in some context. Even experienced programmers only rarely omit them, so as a beginner you should never do so (as for example with your <code>for</code> loop). </p>\n\n<p>Regarding if-else statement the short answer is: it depends.<br>\nSometimes I would use <code>if</code> (note: in your case <code>else</code> is useless). But other times I would use ternary operator: <code>condition ? value_if_true : value_if_false;</code> or even a lambda expression.<br>\nIn this case you should probably settle for an <code>if</code>, as it will be easier and more intuitive for you.</p>\n", "last_activity_date": 1477692214, "answer_id": 40305779, "is_accepted": true, "owner": {"user_id": 2581119, "reputation": 529, "user_type": "registered", "display_name": "Lehu", "link": "http://stackoverflow.com/users/2581119/lehu", "profile_image": "https://www.gravatar.com/avatar/bbdbeb2cb8aa3c89132fe48d744c91d4?s=128&d=identicon&r=PG"}, "last_edit_date": 1477692214, "question_id": 40294461}