{"body": "<p>This is actually pretty simple. By caching 100+ images for each dancer, you are generating a TON of images/canvases in memory. This is 75,000,000 pixels for each dancer. </p>\n\n<p>SpriteSheets are a good way to cache content that is complex. However, drawing and swapping this many large textures may have a detrimental effect, instead of offering any benefits.</p>\n\n<p>There are lots of better ways to do this. </p>\n\n<ol>\n<li><p>If you <em>really</em> want to use SpriteSheets, then make one, and add the custom face over top. So create a container that has the dancer body, and a face sprite/bitmap. You can make as many of these as you like, and not generate a new set of giant images for each one.</p></li>\n<li><p>Rather than make a new SpriteSheet using SpriteSheetBuilder, just generate a definition that uses all your images you are already creating. The SpriteSheet supports multiple images, so you should be able to point each frame to a new image. Then take the same approach as earlier</p></li>\n<li><p>Where did this art come from? If you are animating using body part images, consider doing that in EaselJS instead of saving bitmaps. A bunch of small body parts reused will be <strong>way</strong> more performant. </p></li>\n<li><p>If you started with Vectors, consider using Adobe Animate to export them. This will generate you scalable vector content that you can use instead. Granted, a whole ton of vectors on canvas is not ideal, but it will not be taxing your memory the way you are now.</p></li>\n</ol>\n\n<p>I would also consider preloading the images to create a better experience.\nHope this helps!</p>\n", "tags": ["easeljs", "create.js"], "creation_date": 1477673599, "score": 0, "last_activity_date": 1477673599, "answer_id": 40309735, "is_accepted": true, "owner": {"user_id": 1252916, "reputation": 6908, "user_type": "registered", "display_name": "Lanny", "link": "http://stackoverflow.com/users/1252916/lanny", "profile_image": "https://www.gravatar.com/avatar/2b40513389224dd0b5153528617961d9?s=128&d=identicon&r=PG"}, "title": "Easel.js SpriteSheetBuilder() causing browser to lock up", "question_id": 40294640}