{"title": "Cannot create new record to the database; no error message", "tags": ["c#", "sql"], "creation_date": 1477644711, "score": 0, "body": "<p>As explained in <a href=\"https://blogs.msdn.microsoft.com/smartclientdata/2005/08/26/working-with-local-databases/\" rel=\"nofollow\">this blog</a>, it seems like the problem is in the connection string.</p>\n\n<p>Inside the project folder, 2 <code>.mdf</code> files were created: one is found at the root of the folder (let's call it <code>mdf_1</code>) and the other is inside the <code>bin\\Debug</code> folder (let's call it <code>mdf_2</code>).</p>\n\n<p>Now, taking a look inside the Visual Studio (VS) editor, there are 2 <code>.mdf</code> files shown: one under the Server Explorer, and another under the Solution Explorer. Not taking note of the location (from the properties section) of these <code>.mdf</code> files made me think these 2 <code>.mdf</code> files were the same. The thing is, the one under the Server Explorer is <code>mdf_1</code> while <code>mdf_2</code> is the one under the Solution Explorer.</p>\n\n<p>VS has a behavior that copies <code>mdf_1</code> and overwrites <code>mdf_2</code> everytime the program is run (because by default, <code>.mdf</code> is set to <em>Copy always</em> <code>mdf_1</code> to <code>mdf_2</code>). My connection string was pointing to the <code>mdf_2</code> which explains why despite <code>cmd.ExecuteNonQuery()</code> command returns 1, my successfully inserted records are always erased because of the behavior VS has. And since it is <code>mdf_1</code> that is under Server Explorer, I could not verify the changes in DB. Simply put, I was making changes in <code>mdf_2</code> while trying to look for the changes in <code>mdf_1</code>.</p>\n\n<p>So to avoid this, I modified my connection string by changing the relative path <code>|DataDirectory|</code> in the connection string to the absolute path of <code>mdf_1</code> so that no matter how often VS overwrites <code>mdf_2</code>, the changes I make during runtime in <code>mdf_1</code> aren't overwritten. This was, changes are also reflected in the Server Explorer (where I verify if changes were actually made).</p>\n\n<hr>\n\n<p><strong>tl;dr</strong> : I was updating the <code>.mdf</code> file under <code>bin\\Debug</code> folder during runtime while physically looking for the updates in the <code>.mdf</code> file located in the root of the project.</p>\n", "last_activity_date": 1477672647, "answer_id": 40301425, "is_accepted": false, "owner": {"user_id": 1992547, "reputation": 12, "user_type": "registered", "display_name": "kulit", "link": "http://stackoverflow.com/users/1992547/kulit", "profile_image": "https://www.gravatar.com/avatar/582f7f3b0ab39ea80b25b2c6a8349dd4?s=128&d=identicon&r=PG&f=1"}, "last_edit_date": 1477672647, "question_id": 40276740}