{"body": "<p>Got a reply on the <a href=\"https://groups.google.com/forum/#!topic/fltkgeneral/rLI_yEHMTYY\" rel=\"nofollow\">FLTK Google group</a>, explaining the issue... There is no easy workaround for this...</p>\n\n<blockquote>\n  <p>FLTK delivers key strokes directly to the focus widget. Fl_Value_Input\n  <em>includes</em> an Fl_Input widget, and that widget becomes the focus widget when you click in the input field. </p>\n  \n  <p>Hence the \"parent\" Fl_Value_Input never sees the Fl_KEYDOWN events.\n  Note  that I quoted \"parent\" because Fl_Value_Input is a <em>very</em>\n  special case.  It's not derived from Fl_Group, but it behaves somewhat\n  like an Fl_Group  widget. </p>\n  \n  <p>So why does your derived widget get FL_KEYUP events? That's another \n  feature of FLTK: FL_KEYUP events are also delivered to the focus\n  widget  in the first place. However, AFAICT no core FLTK widget\n  handles FL_KEYUP  events - they all return 0 in their handle()\n  methods. If the focus  widget doesn't handle an event FLTK tries to\n  deliver it to the parent  widget and then up through the widget\n  hierarchy until it reaches the top  level window. Hence (and this <em>is</em>\n  IMHO weird) eventually all widgets  will receive all FL_KEYUP events\n  unless one widget returns 1 from its  handle() method (which is\n  usually not the case). Depending on the depth  of the focus widget in\n  the total widget hierarchy it may be that some  widgets get the same\n  FL_KEYUP event multiple times, because all parent  groups of the focus\n  widget try to deliver the event to all their children.</p>\n</blockquote>\n", "tags": ["fltk"], "creation_date": 1477652234, "score": 0, "last_activity_date": 1477652234, "answer_id": 40303627, "is_accepted": false, "owner": {"user_id": 2554220, "reputation": 419, "user_type": "registered", "accept_rate": 100, "display_name": "Ben", "link": "http://stackoverflow.com/users/2554220/ben", "profile_image": "https://www.gravatar.com/avatar/d2bfcc580376aee99a1985dd462785dd?s=128&d=identicon&r=PG"}, "title": "FLTK: Fl_Value_Input subclass does not receive FL_KEYDOWN events (only FL_KEYUP)", "question_id": 40284104}