{"body": "<p>So I figured out in the end what my issue was. By running <code>mWebview.evaluateJavascript(\"window.location\", null);</code> I realized that I in fact was not actually on the page I thought I was. My ebook page was being loaded into an iframe or some other type of skeleton/wrapper in such a way that the webapp functions were not in fact available when running <code>evaluateJavascript()</code>.</p>\n\n<p>So once figured that out, I can confirm some things that I originally questioned above:</p>\n\n<blockquote>\n  <p>So it seems to be that evaluateJavascript() is being run in a fresh\n  environment/thread. How can I tell it not to?</p>\n</blockquote>\n\n<p>It does not. Just make sure you know what page is actually loaded.</p>\n\n<blockquote>\n  <p>To get around this,I've tried to create an empty javascript interface in the hopes that I could simply initialize my page javascript into it and thus be able to call it from Android.</p>\n</blockquote>\n\n<p>This does in fact work. I'm not sure what my mistake was before, but if I create a javascript interface in Android, it's functions are available to the webapp AND I can in fact write new objects to the interface object from within the webapp. So, initializing new objects into <code>TestInterface</code> from within the webapp can be run within the Android app via:\n<code>mWebview.evaluateJavascript(\"TestInterface.someNewFunctionFromWebapp()\", null);</code></p>\n\n<p>I can NOT however overwrite any existing objects/properties of that javascript interface object. so <code>TestInterface.test()</code> is immutable.</p>\n", "tags": ["javascript", "java", "android", "android-webview"], "creation_date": 1477702228, "score": 0, "last_activity_date": 1477702228, "answer_id": 40314967, "is_accepted": true, "owner": {"user_id": 2607578, "reputation": 359, "user_type": "registered", "accept_rate": 83, "display_name": "brianclements", "link": "http://stackoverflow.com/users/2607578/brianclements", "profile_image": "https://www.gravatar.com/avatar/96fba04723b88d86f9f93bb849392b2e?s=128&d=identicon&r=PG"}, "title": "How to call existing javascript function from android activity", "question_id": 40031157}