{"body": "<p>In an Active Directory environment, Network Service and Local System both have network access to other machines in the domain; the server just needs to be configured to grant access to the client's computer account in the domain, i.e., the <code>COMPUTERNAME$</code> account.  If you use a UNC path the connection will be established automatically.  You still can't use drive letters established in another logon session, but in most circumstances the UNC path will do.</p>\n\n<p>In a stand-alone environment it's a bit trickier.  The only reliable approach is to establish the network connection explicitly, which you can do using <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa385413(v=vs.85).aspx\" rel=\"nofollow\">WNetAddConnection2</a> or any of the various alternatives.  (Or if you can't call the Win32 API, you can shell out to the <code>net use</code> command.)  In either case, once the connection is established you can use a UNC path.  There is typically no need to map a drive letter.</p>\n\n<p>If you <em>must</em> have a drive letter for some reason, it is usually best to use the <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/aa385482(v=vs.85).aspx\" rel=\"nofollow\">WNetUseConnection</a> function instead of WNetAddConnection2.  That can be configured to select a drive letter automatically, so you don't have to try to figure out which letters are already in use.</p>\n\n<p>Note that depending on the circumstances, it may be necessary to use the long form of the username for the account on the server, i.e., <code>SERVERNAME\\USERNAME</code> or <code>DOMAINNAME\\USERNAME</code> if it is a domain account.  Windows 10 clients seem particularly fussy about this for some reason.</p>\n", "tags": ["windows", "networking", "service", "folders", "shared"], "creation_date": 1477697045, "score": 0, "last_activity_date": 1477697045, "answer_id": 40314492, "is_accepted": true, "owner": {"user_id": 886887, "reputation": 23042, "user_type": "registered", "accept_rate": 75, "display_name": "Harry Johnston", "link": "http://stackoverflow.com/users/886887/harry-johnston", "profile_image": "https://www.gravatar.com/avatar/1616c7e4fab23f6e014ee11d75408bba?s=128&d=identicon&r=PG"}, "title": "How do I get a windows service to have access to a shared network folder?", "question_id": 40273742}