{"body": "<p>You usually consider separating your app server which runs python, your database and properly the static and media files for different reasons.</p>\n\n<p>One reason is scalability - if you receive high load on your site, you can easily detect the bottleneck and set up another server to share the load.</p>\n\n<p>Your staticfiles and/or media scales besides your app server and database. If your app server can not handle the load anymore, this must not automatically apply to database or static/media content and vice versa. This always depends on your use case. Separating the stuff in front makes you more flexible.</p>\n\n<p>Another reason is security. If there is security hole e.g. django code, which enables the attacker to run whatever code he/she wants on your host, that other stuff is not directly available on the host.</p>\n\n<p>As mentioned in the <a href=\"https://docs.djangoproject.com/en/1.10/howto/static-files/deployment/#serving-static-files-from-a-dedicated-server\" rel=\"nofollow\">django docs</a> you might want to run a very lightweight setup for the staticfiles, without any code execution from within the webserver (no python, php or whatever - just static files)</p>\n\n<p>The hardware requirements rely on your load and the software you'll pick. If you do not expect high load and just have one server available - nothing is wrong with serving the whole stuff from one host. As already told it always depends on what you want to achieve and which requirements you (or your customers) have regarding your setup.</p>\n", "tags": ["python", "django", "nginx"], "creation_date": 1477740028, "score": 1, "last_activity_date": 1477740028, "answer_id": 40318560, "is_accepted": true, "owner": {"user_id": 5992118, "reputation": 839, "user_type": "registered", "display_name": "dahrens", "link": "http://stackoverflow.com/users/5992118/dahrens", "profile_image": "https://www.gravatar.com/avatar/08ae2e7ce567cbfb93d480892bd10fa0?s=128&d=identicon&r=PG"}, "title": "Django: Static/Media Files different server", "question_id": 40318351}